httperf-logs/simple/test1.txt
httperf --client=0/1 --server=localhost --port=18000 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=1000 --send-buffer=4096 --recv-buffer=16384 --num-conns=1000 --num-calls=1
Maximum connect burst length: 1

Total: connections 1000 requests 1000 replies 1000 test-duration 1.719 s

Connection rate: 581.9 conn/s (1.7 ms/conn, <=10 concurrent connections)
Connection time [ms]: min 0.2 avg 4.4 max 1009.9 median 0.5 stddev 63.5
Connection time [ms]: connect 4.0
Connection length [replies/conn]: 1.000

Request rate: 581.9 req/s (1.7 ms/req)
Request size [B]: 107.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 0.4 transfer 0.0
Reply size [B]: header 90.0 content 4148.0 footer 0.0 (total 4238.0)
Reply status: 1xx=0 2xx=1000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.71 system 1.00 (user 41.3% system 58.1% total 99.4%)
Net I/O: 2468.9 KB/s (20.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0