httperf-logs/simple/test2.txt
httperf --client=0/1 --server=localhost --port=18000 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=2000 --send-buffer=4096 --recv-buffer=16384 --num-conns=2000 --num-calls=1
Maximum connect burst length: 3

Total: connections 2000 requests 2000 replies 2000 test-duration 1.869 s

Connection rate: 1070.2 conn/s (0.9 ms/conn, <=43 concurrent connections)
Connection time [ms]: min 0.2 avg 18.6 max 1224.1 median 0.5 stddev 134.4
Connection time [ms]: connect 17.7
Connection length [replies/conn]: 1.000

Request rate: 1070.2 req/s (0.9 ms/req)
Request size [B]: 107.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 0.9 transfer 0.0
Reply size [B]: header 90.0 content 4148.0 footer 0.0 (total 4238.0)
Reply status: 1xx=0 2xx=2000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.51 system 1.35 (user 27.1% system 72.1% total 99.2%)
Net I/O: 4541.0 KB/s (37.2*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0